import Settings from 'config';

export const phrases = {
  'site': {
    'name': 'get•pallet',
    'phone': '+ 7(921)630-99-59',
    'address': 'г. Санкт-Петербург, ул. Савушкина 83'
  },
  'header': {
    'menu': {
      'catalog': 'каталог',
      'faq': 'faq',
    },
    'cart': {
      'title': 'корзина'
    }
  },
  'instagram': {
    'title': 'Instagram',
    'href': '/'
  },
  'copyright': '© 2018 Getpallet',
  'footer': {
    'shop': 'магазин',
    'faq': 'faq',
    'call': 'связаться с нами'
  },
  'pages': {
    'index': {
      'title': 'главная',
      'main': {
        'title': 'Cтиль<br />настроения&nbsp;&nbsp;&nbsp;&nbsp;<br />—лофт',
        'description': 'Новое решение для интерьера - мебель из паллетов. Мы наполним атмосферу вашего пространства идеей творчества, свободы мысли и самовыражения.',
        'find': 'в каталог',
        'more': 'вдохновиться',
        'banner': `https://cdndev.mentalmarket.io/uploads/products/__213/mid_W24uZ287SiNNU8411g7jpg.png`
        // 'banner': `${Settings.assetHost}/assets/main1.png`
      },
      'showcase': {
        'title': 'Мебель из паллетов отлично впишется в любое пространство',
        'catalog': 'в каталог'
      },
      'slogan': 'Мы создаем стильную и практичную мебель используя только высококачественную древесину. Каждое изделие модульно - его легко не только собирать и разбирать, но и трансформировать во что-то новое.'
    },
    'catalog': {
      'title': 'каталог'
    },
    'why_me': {
      'title': 'почему мы'
    },
    'payment': {
      'title': 'оплата'
    },
    'delivery': {
      'title': 'доставка'
    },
    'product': {
      'category': 'категория',
      'size': 'размер',
      'color': 'цвет',
      'delivery': 'доставим через',
      'to_cart': 'в корзину',
      'another_design': 'хочешь другой дизайн?',
      'same': 'С этим товаром выбирают'
    }
  },
  'questions': {
    'title': 'Популярные вопросы',
    'all': 'посмотреть все вопросы',
    'items': [
      {
        'id': 'who-we-are',
        'question': 'Что за GetPallet?',
        'answer': 'Мы создаем авторскую мебель из паллетов. В нашей компании работают только профессионалы, с большим опытом в сфере производства и проектирования мебели.'
      },
      {
        'id': 'why-me',
        'question': 'Почему мебель из паллетов?',
        'answer': 'Потому что она отлично вписывается в любой интерьер, будь то офис, спальня, гостиная или бар. Мы продумали нашу мебель так, что ее легко собирать и разбирать. Также вы можете подобрать цвет или дизайн изделия.'
      },
      {
        'id': 'delivery',
        'question': 'Что с доставкой?',
        'answer': 'По Санкт-Петербургу (в пределах КАД) - 1000 рублей, за пределами - индивидуально. Срок доставки зависит от заказа (на странице каждого товара указано время изготовления). Самовывоз по адресу: Санкт-Петербург, ул. Литовская, дом 10. В другие регионы товар отправляем по готовности компанией СДЭК (срок доставки устанавливает перевозчик).'
      },
      {
        'id': 'payment',
        'question': 'Как оплатить?',
        'answer': "Мы предоставляем несколько способов оплаты: <li> 1. Банковской картой на сайте </li> <li> 2. Банковской картой или наличными при получении товара </li> <li> 3. Безналичный расчет (только для юр. лиц). </li>"
      },
      {
        'id': 'guarantee',
        'question': 'Гарантия',
        'answer': '1 год на всю продукцию с момента покупки'
      },
    ]
  },
  'products': {
    'more': 'подгрузить еще'
  },
  'rubrics': [
    {
      'title': 'Для спальни',
      'description': 'создадим атмосферу для насыщенных и ярких снов',
      'href': '/',
      'image': `https://cdndev.mentalmarket.io/uploads/products/__215/thumb_3i7kTALp27ZbSXLxBm7yAA.png`
    },
    {
      'title': 'Для офиса',
      'description': 'отличное решение для кабинетов и опенспАйсов',
      'href': '/',
      'image': `https://cdndev.mentalmarket.io/uploads/products/__214/thumb_s4HvtQ-u5KiaoA73asQIiw.png`
    },
    {
      'title': 'Для гостинной',
      'description': 'зададим настроение для вечерних посиделок',
      'href': '/',
      'image': `https://cdndev.mentalmarket.io/uploads/products/__216/thumb_3NFkE9dF0rH9KI4EJYGSCg.png`
    },
    {
      'title': 'Для баров и кафе',
      'description': 'удивим ваших посетителей ярким стилем',
      'href': '/',
      'image': `https://cdndev.mentalmarket.io/uploads/products/__218/thumb_Zrj5A0-Ok-_aHDXHVV-jVg.png`
    },
    {
      'title': 'Для мероприятий',
      'description': 'удобно разместим сотни человек',
      'href': '/',
      'image': `https://cdndev.mentalmarket.io/uploads/products/__217/thumb_wd2yw3hhExWBfB1RAsDygg.png`
    },
    {
      'title': 'Для магазинов',
      'description': 'вдохновим на приятные покупки',
      'href': '/',
      'image': `https://cdndev.mentalmarket.io/uploads/products/__210/thumb_zqQNNEmyd9Zm8nrWbkn5rw.png`
      // 'image': `${Settings.assetHost}/assets/rubric2.png`
    }
  ],
  'product': {
    'add_to_cart': 'в корзину',
    'in_cart': 'в корзине'
  },
  'order': {
    'statuses': {
      'draft': 'новый',
      'ready': 'готов к доставке',
      'canceled': 'отменен',
      'completed': 'вручен'
    },
    'payment_statuses': {
      'not_paid': 'не оплачен',
      'completed': 'оплачен',
      'failed': 'ошибка оплаты'
    },
    'delivery_types': {
      'courier': 'курьер',
      'pickup': 'самовывоз'
    },
    'payment_types': {
      'cash': 'наличными курьеру',
      'card': 'онлайн'
    }
  },
  'faq': {  
    title: 'faq',
    questions: [
      {
        'id': 'relations',
        'question': 'Можно ли сотрудничать с нами?',
        'answer': 'Мы всегда открыты для предложений! Если у вас есть идеи по развитию продукта или предложения по взаимодействию, пришлите их на почту info@getpallet.ru.'
      },
      {
        'id': 'diffucult',
        'question': 'Сложно ли собрать мебель?',
        'answer': 'При доставке - соберем бесплатно. Комплектующие и инструкция в каждом заказе, понадобиться только отвертка.'
      },
      {
        'id': 'how_long',
        'question': 'Через сколько я получу заказ?',
        'answer': 'Период доставки зависит от выбранного вами изделия (на странице каждого товара указано время изготовления). Например, паллет мы доставим вам уже завтра, а кровать только через три дня.'
      },
      {
        'id': 'custom_color',
        'question': 'Хочу кровать другого цвета, что делать?',
        'answer': 'Можем изготовить мебель любого цвета, нажмите "<a href="?action=feedback">здесь</a>" и расскажите нам подробнее.'
      },
      {
        'id': 'how_you_made_this',
        'question': 'Как производите мебель?',
        'answer': 'В основе каждой модели лежат деревянные паллеты различных размеров и цветов. За счет собственного производства мы добиваемся идеально ровных и качественных изделий, так как привычные всем "паллеты" не пригодны для мебели (кровать будет не ровная, а стол будет шататься)'
      },
      {
        'id': 'windowsxp',
        'question': 'Хочу на паллете логотип Windows XP! что делать?',
        'answer': 'Прекрасный вкус! Нажмите "<a href="?action=feedback">здесь</a>" и расскажите подробнее. После заполнения формы мы непременно с вами свяжемся и согласуем детали. Стоимость принта варьируется от 2000 до 5000 рублей в зависимости от сложности. Все индивидуальные заказы изготавливаются по предоплате.'
      },
      {
        'id': 'something_custom',
        'question': 'Я хочу оформить дизайн интерьера, поможете?',
        'answer': 'В нашей команде есть опытные дизайнеры, которые спроектируют интерьер пространства, учитывая ваши пожелания. Нажмите "<a href="?action=feedback">здесь</a>" и расскажите подробнее что именно вы хотите. После заполнения формы мы непременно с вами свяжемся и согласуем детали.'
      },
      {
        'id': 'not_found',
        'question': 'Не нашел на GetPallet нужной мебели, что делать?',
        'answer': 'Не волнуйтесь! Под ваш интерьер мы разработаем уникальную и функциональную мебель под заказ. Нажмите "<a href="?action=feedback">здесь</a>"  и расскажите подробнее что именно вы хотите. После заполнения формы мы непременно с вами свяжемся и согласуем детали.'
      },
      {
        'id': 'returns',
        'question': 'Я хочу совершить возврат товара, какие мои действия?',
        'answer': `
          Алгоритм следующий:
          При оплате картами возврат наличными денежными средствами не допускается. Порядок возврата регулируется правилами международных платежных систем.
          Процедура возврата товара регламентируется статьей 26.1 федерального закона «О защите прав потребителей».
          <li>1. Потребитель вправе отказаться от товара в любое время до его передачи, а после передачи товара - в течение семи дней;</li>
          <li>2. Возврат товара надлежащего качества возможен в случае, если сохранены его товарный вид, потребительские свойства, а также документ, подтверждающий факт и условия покупки указанного товара;</li>
          <li>3. Потребитель не вправе отказаться от товара надлежащего качества, имеющего индивидуально-определенные свойства, если указанный товар может быть использован исключительно приобретающим его человеком;</li>
          <li>4. При отказе потребителя от товара продавец должен возвратить ему денежную сумму, уплаченную потребителем по договору, за исключением расходов продавца
          на доставку от потребителя возвращенного товара, не позднее чем через десять дней со дня предъявления потребителем соответствующего требования;</li>
          Для возврата денежных средств на банковскую карту необходимо заполнить «Заявление о возврате денежных средств», которое высылается по требованию компанией на электронный адрес и оправить его вместе с приложением копии паспорта по адресу info@getpallet.ru
          Возврат денежных средств будет осуществлен на банковскую карту в течение 21 (двадцати одного) рабочего дня со дня получения «Заявление о возврате денежных средств» Компанией.
          Для возврата денежных средств по операциям проведенными с ошибками необходимо обратиться с письменным заявлением и приложением копии паспорта и чеков/квитанций, подтверждающих ошибочное списание. Данное заявление необходимо направить по адресу info@getpallet.ru
          Сумма возврата будет равняться сумме покупки. Срок рассмотрения Заявления и возврата денежных средств начинает исчисляться с момента получения Компанией Заявления и рассчитывается в рабочих днях без учета праздников/выходных дней.`
      },
      {
        'id': 'more_about_payment',
        'question': 'Подробнее про оплату и возвраты',
        'answer': `
        Оплата банковскими картами осуществляется через АО «АЛЬФА-БАНК». К оплате принимаются карты VISA, MasterCard, Платежная система «Мир».

        Услуга оплаты через интернет осуществляется в соответствии с Правилами международных платежных систем Visa, MasterCard и Платежная система «Мир» на
        принципах соблюдения конфиденциальности и безопасности совершения платежа, для чего используются самые современные методы проверки, шифрования и передачи данных  по закрытым каналам связи. Ввод данных банковской карты осуществляется на защищенной платежной странице АО «АЛЬФА-БАНК».

        На странице для ввода данных банковской карты потребуется ввести данные банковской карты: номер карты, имя владельца карты, срок действия карты, трёхзначный код безопасности (CVV2 для VISA или CVC2 для MasterCard). Все необходимые данные пропечатаны на самой карте. Трёхзначный код безопасности — это три цифры, находящиеся на обратной стороне карты. Далее вы будете перенаправлены на страницу Вашего банка для ввода 3DSecure кода, который придет к Вам в СМС. Если 3DSecure код к Вам не пришел, то следует обратится в банк выдавший Вам карту.

        Случаи отказа в совершении платежа:
        <li>1. банковская карта не предназначена для совершения платежей через интернет, о чем можно узнать, обратившись в Ваш Банк;</li>
        <li>2. недостаточно средств для оплаты на банковской карте. Подробнее о наличии средств на банковской карте Вы можете узнать, обратившись в банк, выпустивший банковскую карту;</li>
        <li>3. данные банковской карты введены неверно;</li>
        <li>4. истек срок действия банковской карты. Срок действия карты, как правило, указан на лицевой стороне карты (это месяц и год, до которого действительна карта). Подробнее о сроке действия карты Вы можете узнать, обратившись в банк, выпустивший банковскую карту;</li>
        По вопросам оплаты с помощью банковской карты и иным вопросам, связанным с работой сайта, Вы можете обращаться по следующим телефонам: 8 (921) 797-35-03
        Предоставляемая вами персональная информация (имя, адрес, телефон, e-mail, номер банковской карты) является конфиденциальной и не подлежит разглашению. Данные вашей кредитной карты передаются только в зашифрованном виде и не сохраняются на нашем Web-сервере.`
      },
      {
        'id': 'requisite',
        'question': 'Наши реквизиты',
        'answer': `
          Реквизиты:
          ООО «СКАНТ»
          197022, Санкт-Петербург, пр. Каменноостровский, дом 62, литер А, пом. 5-Н, офис №3Ф
          ИНН 7813623082, КПП 781301001
          р/с 40702810432510000378, БИК 044030786`
      },
      {
        'id': 'iamcompany',
        'question': 'Я представитель компании, будет скидка?',
        'answer': 'Да, конечно! У нас предусмотрена система скидок, условия обсуждаем индивидуально'
      },
    ]
  },
  'feedback': {
    'title': 'Связаться с нами',
    'name': 'имя',
    'phone': 'телефон',
    'comment': 'комментарий',
    'send': 'Отправить',
    'success': 'Запрос успешно отправлен, мы свяжемся с вами в ближайшее время!'
  }
};
